tap "argoproj/tap"
tap "atlassian/acli", "https://github.com/atlassian/homebrew-acli.git"
tap "azure/bicep"
tap "azure/functions"
tap "derailed/popeye"
tap "driftive/tap"
tap "fairwindsops/tap", "https://github.com/FairwindsOps/homebrew-tap"
tap "hashicorp/tap"
tap "knative-extensions/kn-plugins"
tap "knative/client"
tap "little-angry-clouds/my-brews", trusted: true
tap "norwoodj/tap"
tap "robscott/tap"
tap "sayyoungman/tap", "https://github.com/SayYoungMan/homebrew-tap"
# vscode
cask "visual-studio-code"
# Run your GitHub Actions locally
brew "act"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Azure Storage data transfer utility
brew "azcopy"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# CLI to facilitate terraforming your existing Cloudflare resources
brew "cf-terraforming"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Cloud provider for KIND clusters
brew "cloud-provider-kind"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tool to generate cobra applications and commands
brew "cobra-cli"
# Container Signing
brew "cosign"
# Spell checker for code
brew "cspell"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Detect, track and alert on infrastructure drift
brew "driftctl"
# Diff tool for YAML files, and sometimes JSON
brew "dyff"
# Build automation tool for the container era
brew "earthly"
# GNU Emacs text editor
brew "emacs"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# CLI for Drive, Gmail, Calendar, Sheets, Docs, Chat, Admin, and more
brew "googleworkspace-cli"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Vulnerability scanner for container images and filesystems
brew "grype"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Language server for Helm
brew "helm-ls"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Network, Service & Security Observability for Kubernetes using eBPF
brew "hubble"
# Cost estimates for Terraform, Terragrunt, and CloudFormation
brew "infracost"
# Interactive computing in Python
brew "ipython"
# Istio configuration command-line utility
brew "istioctl"
# Handy way to save and run project-specific commands
brew "just"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# CLI tool to discover unused Kubernetes resources
brew "kor"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes testing according to Hardening Guidance by NSA and CISA
brew "kubescape"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Kubernetes Native Policy Management
brew "kyverno"
# Simple terminal UI for git commands
brew "lazygit"
# And for docker
brew "lazydocker"
# Modern and intuitive terminal-based text editor
brew "micro"
# Run a Kubernetes cluster locally
brew "minikube"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Atlas CLI enables you to manage your MongoDB Atlas
brew "mongodb-atlas-cli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Python compiler written in Python
brew "nuitka"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Bundle a Python application and all its dependencies
brew "pyinstaller"
# Automated dependency updates. Flexible so you don't need to be
brew "renovate"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# GNU Stow - symlink farm manager (used to deploy these dotfiles)
brew "stow"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# CLI for generating a Software Bill of Materials from container images
brew "syft"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Managing Terraform stacks with change detections and code generations
brew "terramate"
# CLI to print the summary of the terraform plan
brew "tf-summarize"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Programmatically correct mistyped console commands
brew "thefuck"
# OpenTofu Language Server
brew "tofu-ls"
# OpenTofu version manager inspired by tfenv
brew "tofuenv"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Lookup tool for domain names and other internet resources
brew "whois"
# Access X11 clipboards from the command-line
brew "xclip"
# Language Server for Yaml Files
brew "yaml-language-server", link: false
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Kubectl Argo Rollouts Plugin.
brew "argoproj/tap/kubectl-argo-rollouts", trusted: true
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4", trusted: true
# A Kubernetes Cluster sanitizer and linter!
brew "derailed/popeye/popeye", trusted: true
# Driftive detects state drifts in Terragrunt projects
brew "driftive/tap/driftive", trusted: true
# Detect deprecated Kubernetes apiVersions
brew "fairwindsops/tap/pluto", trusted: true
# Packer
brew "hashicorp/tap/packer", trusted: true
# Terraform Language Server
brew "hashicorp/tap/terraform-ls", trusted: true
brew "knative-extensions/kn-plugins/quickstart", trusted: true
brew "knative/client/kn", trusted: true
# Helm version manager inspired by tfenv
brew "little-angry-clouds/my-brews/helmenv"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs", trusted: true
# kube-capacity provides an overview of the resource requests, limits, and utilization in a Kubernetes cluster
brew "robscott/tap/kube-capacity", trusted: true
# Terminal-based AI coding assistant
cask "claude-code@latest"
# Interactive terminal UI for Terraform plan/apply workflows
cask "sayyoungman/tap/tfui"
brew "lazydocker"
krew "cost"
krew "deprecations"
krew "sniff"
